app/controllers/asam_master_controller.rb

SELECT "ASAM_MASTER".* FROM "ASAM_MASTER" WHERE (lower(victim) = 'yacht') AND ("ASAM_MASTER"."OCCUR_DATE" BETWEEN TO_DATE('2001-01-01 00:00:00','YYYY-MM-DD HH24:MI:SS') AND TO_DATE('2001-12-31 00:00:00','YYYY-MM-DD HH24:MI:SS')) ORDER BY occur_date DESC, tx_yyyy DESC, tx_num DESC
---
  def asam_query
    msi_query_type = params[:MSI_queryType]
    msi_filter_type = params[:MSI_generalFilterType]
    msi_filter_value = params[:MSI_generalFilterValue]
    msi_filter_type1 = params[:MSI_additionalFilterType1]
    msi_filter_type2 = params[:MSI_additionalFilterType2]
    msi_filter_value1 = params[:MSI_additionalFilterValue1]
    msi_filter_value2 = params[:MSI_additionalFilterValue2]
    msi_sort_type = params[:MSI_outputOptionType1]
    msi_output_option_type2 = params[:MSI_outputOptionType2]
    msi_sort_value = params[:MSI_outputOptionValue1]
    msi_output_option_value2 = params[:MSI_outputOptionValue2]
    msi_map = params[:MSI_MAP]
    @searchparam = Array.new
    sort_ord = ''


    #Search ASAMs with no criteria selected - return ALL ASAM messages
    if msi_filter_type == 'All'
      #Sort by date of message
      if msi_sort_value.include? 'Date'
        sort_ord = 'occur_date DESC' if msi_sort_value.include? 'DESC'
        sort_ord = 'occur_date ASC' if msi_sort_value.include? 'ASC'
        @searchparam[0] = 'All Anti-Shipping Activity Messages'
        @searchparam[1] = msi_filter_value
        @searchparam[2] = 'None'
        @searchparam[3] = 'Descending Date of Occurrence' if msi_sort_value.include? 'DESC'
        @searchparam[3] = 'Ascending Date of Occurrence' if msi_sort_value.include? 'ASC'
        if msi_filter_type1 == 'SpecificDate'
          asamdate = DateTime.parse(msi_filter_value1)
          @asams = AsamMaster.where(occur_date: asamdate).order(sort_ord)

SELECT "ASAM_MASTER".* FROM "ASAM_MASTER" WHERE (lower(victim) = 'yacht') ORDER BY tx_yyyy DESC, tx_num DESC
---
          asamdate = msi_filter_value1.split(':')
          date1 = DateTime.parse(asamdate[0])
          date2 = DateTime.parse(asamdate[1])
          @asams = AsamMaster.where("occur_date >= #{date1} and occur_date <= #{date2}").order(sort_ord)

SELECT "ASAM_MASTER".* FROM "ASAM_MASTER" WHERE "ASAM_MASTER"."SUBREGION" = '24' ORDER BY occur_date DESC, tx_yyyy DESC, tx_num DESC
---
        @searchparam[3] = 'Ascending Date of Occurrence' if msi_sort_value.include? 'ASC'
        if msi_filter_type1 == 'SpecificDate'
          asamdate = DateTime.parse(msi_filter_value1)
          @asams = AsamMaster.where(subregion: msi_filter_value).where(occur_date: asamdate).order(sort_ord)

SELECT "ASAM_MASTER".* FROM "ASAM_MASTER" WHERE "ASAM_MASTER"."SUBREGION" = '61' ORDER BY tx_yyyy DESC, tx_num DESC
---
          asamdate = msi_filter_value1.split(':')
          date1 = DateTime.parse(asamdate[0])
          date2 = DateTime.parse(asamdate[1])
          @asams = AsamMaster.where(subregion: msi_filter_value).where("occur_date >= #{date1} and occur_date <= #{date2}").order(sort_ord)

SELECT "ASAM_MASTER".* FROM "ASAM_MASTER" WHERE "ASAM_MASTER"."TX_YYYY" = 1991 AND "ASAM_MASTER"."TX_NUM" = 4
---
        asamdate = msi_filter_value1.split(':')
        date1 = DateTime.parse(asamdate[0])
        date2 = DateTime.parse(asamdate[1])
        @asams = AsamMaster.where(tx_yyyy: ref[0]).where(tx_num: ref[1]).where("occur_date >= #{date1} and occur_date <= #{date2}")

SELECT "ASAM_MASTER".* FROM "ASAM_MASTER" WHERE "ASAM_MASTER"."VICTIM" = 'vanderpool express'
---
      name = msi_filter_value.downcase
      if msi_filter_type1 == 'SpecificDate'
        asamdate = DateTime.parse(msi_filter_value1)
        @asams = AsamMaster.where('lower(victim) = ?', name).where(occur_date: asamdate).order(sort_ord)